beber007/escapement/Escapement/CORTEX-Mx/STM32/Escapement_Interrupts.h
  #if defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_DMA2_Channel1      56 /* DMA 2 channel 1 (global) */
     #define OS_IO_DMA2_Channel2      57 /* DMA 2 channel 2 (global) */
     #define OS_IO_DMA2_Channel3      58 /* DMA 2 channel 3 (global) */
  #endif
  #if defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     #define OS_IO_DMA2_Channel4_5    59 /* DMA 2 channels 4 and 5 (global) */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_DMA2_Channel4      59 /* DMA 2 channel 4 (global) */
  #endif
  #if defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
     #define OS_IO_DMA2_Channel5      60 /* DMA 2 channel 5 (global) (Channel 5 is mapped
                                            at position 60 only if the MISC_REMAP bit in
                                            the AFIO_MAPR2 register is set) */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_DMA2_Channel5      60 /* DMA 2 channel 5 (global) */
  #endif
  #if defined(STM32F107XX)
     #define OS_IO_ETH                61 /* Ethernet (global) */
     #define OS_IO_ETH_WKUP           62 /* Ethernet wake-up through EXTI line */
  #endif
  #if defined(STM32F105XX) || defined(STM32F107XX)
     #define OS_IO_CAN2_TX            63 /* CAN 2 TX */
     #define OS_IO_CAN2_RX0           64 /* CAN 2 RX0 */
     #define OS_IO_CAN2_RX1           65 /* CAN 2 RX1 */
     #define OS_IO_CAN2_SCE           66 /* CAN 2 SCE */
     #define OS_IO_OTG_FS             67 /* USB on-the-go full-speed (global) */
  #endif
/* ------------------------------ STM32F2 and STM32F4 ------------------------------- */
#elif defined(STM32F2XXXX) || defined(STM32F4XXXX)
  #define OS_IO_ADC                   18 /* ADC 1, 2 and 3 (global) */
  #define OS_IO_CAN1_TX               19 /* CAN 1 TX */
  #define OS_IO_CAN1_RX0              20 /* CAN 1 RX0 */
  #define OS_IO_CAN1_RX1              21 /* CAN 1 RX1 */
  #define OS_IO_CAN1_SCE              22 /* CAN 1 SCE */
  #define OS_IO_EXTI9_5               23 /* External lines 5 to 9 */
  #define OS_IO_TIM1_BRK_TIM9         24 /* Timer 1 break and timer 9 (global) */
  #define OS_IO_TIM1_BRK              (OS_IO_TIM1_BRK_TIM9 | 0x100)
  #define OS_IO_TIM9                  (OS_IO_TIM1_BRK_TIM9 | 0x200)
  #define OS_IO_TIM1_UP_TIM10         25 /* Timer 1 update and timer 10 (global) */
  #define OS_IO_TIM1_UP               (OS_IO_TIM1_UP_TIM10 | 0x100) 
  #define OS_IO_TIM10                 (OS_IO_TIM1_UP_TIM10 | 0x200)
  #define OS_IO_TIM1_TRG_COM_TIM11    26 /* Timer 1 trigger and commutation, and
                                            timer 11 (global) */
  #define OS_IO_TIM1_TRG_COM          (OS_IO_TIM1_TRG_COM_TIM11 | 0x100)
  #define OS_IO_TIM11                 (OS_IO_TIM1_TRG_COM_TIM11 | 0x100)
  #define OS_IO_TIM1_CC               27 /* Timer 1 capture/compare */
  #define OS_IO_TIM1                  OS_IO_TIM1_CC
  #define OS_IO_TIM2                  28 /* Timer 2 (global) */
  #define OS_IO_TIM3                  29 /* Timer 3 (global) */
  #define OS_IO_TIM4                  30 /* Timer 4 (global) */
  #define OS_IO_I2C1_EV               31 /* I2C 1 event */
  #define OS_IO_I2C1_ER               32 /* I2C 1 error */
  #define OS_IO_I2C2_EV               33 /* I2C 2 event */
  #define OS_IO_I2C2_ER               34 /* I2C 2 error */
  #define OS_IO_SPI1                  35 /* SPI 1 (global) */
  #define OS_IO_SPI2                  36 /* SPI 2 (global) */
  #define OS_IO_USART1                37 /* USART 1 (global) */
  #define OS_IO_USART2                38 /* USART 2 (global) */
  #define OS_IO_USART3                39 /* USART 3 (global) */
  #define OS_IO_EXTI15_10             40 /* External lines 10 to 15 */
  #define OS_IO_RTC_Alarm             41 /* RTC alarm (A and B) through EXTI line */
  #define OS_IO_OTG_FS_WKUP           42 /* USB on-the-go full-speed wake-up from suspend
                                            through EXTI line */
  #define OS_IO_TIM8_BRK_TIM12        43 /* Timer 8 break and timer 12 (global) */
  #define OS_IO_TIM8_BRK              (OS_IO_TIM8_BRK_TIM12 | 0x100)
  #define OS_IO_TIM12                 (OS_IO_TIM8_BRK_TIM12 | 0x200)
  #define OS_IO_TIM8_UP_TIM13         44 /* Timer 8 update and timer 13 (global) */
  #define OS_IO_TIM8_UP               (OS_IO_TIM8_UP_TIM13 | 0x100)
  #define OS_IO_TIM13                 (OS_IO_TIM8_UP_TIM13 | 0x200)
  #define OS_IO_TIM8_TRG_COM_TIM14    45 /* Timer 8 trigger and commutation, and
                                            timer 14 (global) */
  #define OS_IO_TIM8_TRG_COM          (OS_IO_TIM8_TRG_COM_TIM14 | 0x100)
  #define OS_IO_TIM14                 (OS_IO_TIM8_TRG_COM_TIM14 | 0x200)
  #define OS_IO_TIM8_CC               46 /* Timer 8 capture/compare */
  #define OS_IO_TIM8                  OS_IO_TIM8_CC
  #define OS_IO_DMA1_Stream7          47 /* DMA 1 stream 7 */
  #if defined(STM32F205VX_ZX) || defined(STM32F215VX_ZX) || defined(STM32F207XX) || \
      defined(STM32F217XX) || defined(STM32F405VX_ZX) || defined(STM32F415VX_ZX) || \
      defined(STM32F407XX) || defined(STM32F417XX) || \
      defined(STM32F427XX) || defined(STM32F429XX)
     #define OS_IO_FSMC               48  /* Flexible static memory controller (global) */
  #endif
  #define OS_IO_SDIO                  49 /* Secure digital input/output interface (global) */
  #define OS_IO_TIM5                  50 /* Timer 5 (global) */
  #define OS_IO_SPI3                  51 /* SPI 3 (global) */
  #define OS_IO_UART4                 52 /* UART 4 (global) */
  #define OS_IO_UART5                 53 /* UART 5 (global) */
  #define OS_IO_TIM6_DAC              54 /* Timer 6 (global) and DAC 1 & 2 underrun error */
  #define OS_IO_TIM7                  55 /* Timer 7 (global) */
  #define OS_IO_DMA2_Stream0          56 /* DMA 2 stream 0 (global) */
  #define OS_IO_DMA2_Stream1          57 /* DMA 2 stream 1 (global) */
  #define OS_IO_DMA2_Stream2          58 /* DMA 2 stream 2 (global) */
  #define OS_IO_DMA2_Stream3          59 /* DMA 2 stream 3 (global) */
  #define OS_IO_DMA2_Stream4          60 /* DMA 2 stream 4 (global) */
  #if defined(STM32F207XX) || defined(STM32F217XX) || defined(STM32F407XX) || \
      defined(STM32F417XX) || defined(STM32F427XX) || defined(STM32F429XX)
     #define OS_IO_ETH                61 /* Ethernet (global) */
     #define OS_IO_ETH_WKUP           62 /* Ethernet wake-up through EXTI line */
  #endif
  #define OS_IO_CAN2_TX               63 /* CAN 2 TX */
  #define OS_IO_CAN2_RX0              64 /* CAN 2 RX0 */
  #define OS_IO_CAN2_RX1              65 /* CAN 2 RX1 */
  #define OS_IO_CAN2_SCE              66 /* CAN 2 SCE */
  #if defined(STM32F207XX) || defined(STM32F217XX) || defined(STM32F407XX) || \
      defined(STM32F417XX) || defined(STM32F427XX) || defined(STM32F429XX)
     #define OS_IO_OTG_FS             67 /* USB on-the-go full-speed (global) */
  #endif
  #define OS_IO_DMA2_Stream5          68 /* DMA 2 stream 5 (global) */
  #define OS_IO_DMA2_Stream6          69 /* DMA 2 stream 6 (global) */
  #define OS_IO_DMA2_Stream7          70 /* DMA 2 stream 7 (global) */
  #define OS_IO_USART6                71 /* USART 6 (global) */
  #define OS_IO_I2C3_EV               72 /* I2C 3 event */
  #define OS_IO_I2C3_ER               73 /* I2C 3 error */
  #define OS_IO_OTG_HS_EP1_OUT        74 /* USB on-the-go HS end point 1 out (global) */
  #define OS_IO_OTG_HS_EP1_IN         75 /* USB on-the-go HS end point 1 in (global) */
  #define OS_IO_OTG_HS_WKUP           76 /* USB on-the-go HS wake-up through EXTI */
  #define OS_IO_OTG_HS                77 /* USB on-the-go high-speed (global) */
  #if defined(STM32F207XX) || defined(STM32F217XX) || defined(STM32F407XX) || \
      defined(STM32F417XX) || defined(STM32F427XX) || defined(STM32F429XX)
     #define OS_IO_DCMI               78 /* Digital camera interface (global) */
  #endif
  #if defined(STM32F215RX) || defined(STM32F215VX_ZX) || defined(STM32F217XX) || \
      defined(STM32F415RG) || defined(STM32F415VG_ZG) || defined(STM32F417XX)
     #define OS_IO_CRYP               79 /* Cryptographic processor (global) */
  #endif
  #define OS_IO_HASH_RNG              80 /* Hash processor and random number generator
                                            (global) */
  #if defined(STM32F4XXXX)
     #define OS_IO_FPU                81 /* Floating-point unit (global) */
  #endif
  #if defined(STM32F427XX) || defined(STM32F429XX)
     #define OS_IO_UART7              82 /* UART 7 interrupt (global) */
     #define OS_IO_UART8              83 /* UART 8 interrupt (global) */
     #define OS_IO_SPI4               84 /* SPI 4 interrupt (global) */
     #define OS_IO_SPI5               85 /* SPI 5 interrupt (global) */
     #define OS_IO_SPI6               86 /* SPI 6 interrupt (global) */
     #define OS_IO_SAI1               87 /* Serial Audio Interface (global) */
     #define OS_IO_LCDTFT             88 /* LCD Controller (global) */
     #define OS_IO_LCDTFT_ERR         89 /* LCD Controller error (global) */
     #define OS_IO_DMA2D              90 /* DMA2D (global) */
  #endif
#else
  #error STM32 version undefined
#endif

#endif /* _ESCAPEMENT_INTERRUPTS_ */

